{
    "Services and Facilities": [
        "The new self-checkout kiosks are very efficient. I can borrow books quickly now.",
        "I love the study areas, but sometimes they're too crowded. Could we have more?",
        "The Wi-Fi speed has improved significantly. It's much easier to work at the library now.",
        "The aircon is not working."
    ],
    "Collection": [
        "I'm impressed by the diverse range of books in the science fiction section.",
        "Could we get more copies of popular titles? The waiting list is often quite long.",
        "The e-book collection is fantastic, but I'd love to see more audiobooks added.",
        "The books are too old and worn out."
    ],
    "Customer Service": [
        "The librarian who helped me find research materials was extremely knowledgeable and patient.",
        "I had an issue with my library card, and the staff resolved it quickly and professionally.",
        "The online chat support is very helpful, but sometimes the wait times are long.",
        "The staff are very busy and not able to assist"
    ],
    "Environment": [
        "The new lighting in the reading areas is much better for my eyes. Thank you!",
        "The library is always clean and well-maintained. It's a pleasure to visit.",
        "Could we have more plants or green spaces in the library? It would improve the ambiance.",
        "The aircon is too cold."
    ],
    "Programmes": [
        "The children's storytelling sessions are wonderful. My kids look forward to them every week.",
        "I attended a workshop on digital literacy and found it very informative. Please organise more such events.",
        "The book club meetings are great, but it would be nice to have more variety in the book selections.",
        "We robotics programme are always sold out, can we add more schedules?"
    ],
    "Policies and Procedures": [
        "The extended loan period during holidays is very convenient. Thank you for implementing this.",
        "The late return fees seem a bit high. Could you consider reducing them?",
        "I appreciate the new online reservation system. It's much more convenient than the old one.",
        "Is sleeping allowed in the library?"
    ]
}